Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/children_s_rights_and_policy/children_and_rights_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: • 12+: The game content is suitable for children aged 12 or over
ga: • 12+: Ábhar an chluiche feiliúnach do leanaí atá 12 bliana d’aois nó níos sine

source: • 16+: The game content is suitable for children aged 16 or over
ga: • 16+: Ábhar an chluiche feiliúnach do leanaí atá 16 bliana d’aois nó níos sine

source: • 18+: The game content is suitable for people aged 18 or over
ga: • 18+: Ábhar an chluiche feiliúnach do leanaí atá 18 mbliana d’aois nó níos sine

source: The age rating does not take into account the difficulty level or skills required to play a game
ga: Ní thógann an rátáil aoise an leibhéal deacrachta nó scileanna a bhíonn ag teastáil chun an cluiche a imirt san áireamh

source: Under the Control of Dogs Act 1986 you cannot keep a dog unless you have a dog licence for it
ga: Faoin Acht um Rialú Madraí 1986, ní féidir madra a choinneáil gan cheadúnas madraí

source: A local authority does not issue a dog licence to anyone under 16 years of age
ga: Ní eisíonn údarás áitiúil ceadúnas madraí ar dhuine ar bith atá faoi bhun 16 bliana d’aois

source: If you have your dog out in public you must keep it under control, such as on a lead
ga: Caithfear madra a choinneáil faoi shrian nuair atá siad amuigh go poiblí - trí choniall mar shampla

source: Certain breeds of dog must be muzzled at all times in public
ga: Caithfidh béalgharda a bheith ar phóir madraí áirithe i gcónaí nuair atá siad amuigh go poiblí

source: These dogs must be led by someone over the age of 16 and kept on a strong chain or lead that is no longer than 2 metres
ga: Caithfidh na madraí sin a bheith faoi stiúir duine atá níos sine ná 16 bliana d’aois agus coinnithe ar shlabhra nó coniall láidir nach bhfuil níos faide ná 2 mhéadar

source: You do not require a licence to own other pets and there is no legislation specifying a minimum age at which you can own a pet
ga: Níl aon riachtanas ann ceadúnas a bheith agat do pheataí eile agus níl aon reachtaíocht a shonraíonn aois íosta maidir le húinéireacht peataí

source: Drones and model aircraft
ga: Dróin agus aerárthaí mionsamhlacha

source: Drones and model aircraft weighing 1kg or more, and less than 25kg, must be registered with the Irish Aviation Authority (IAA)
ga: Ní mór dróin agus aerárthaí mionsamhlacha ar a bhfuil meáchan 1kg nó níos mó, agus meáchan níos lú ná 25kg, a chlárú le hÚdarás Eitlíochta na hÉireann (ÚEÉ)

source: When calculating the weight, fuel is not included. However, any articles or equipment installed in or attached to the aircraft at the start of its flight, including cargo, are included
ga: Nuair a bhíonn an meáchan á ríomh, ní chuirtear breosla san áireamh, ach cuirtear san áireamh aon earraí nó trealamh atá suiteáilte san aerárthach nó ceangailte leis an aerárthach, lastas ina measc, ag tús a eitilte, áfach

source: You must be over 16 years of age to register a drone or model aircraft
ga: Ní mór duit bheith os cionn 16 bliana d’aois chun drón nó aerárthach mionsamhlach a chlárú

source: Drones and model aircraft operated by those under 16 years of age must be registered by a parent or legal guardian
ga: Ní mór do dhróin agus aerárthaí mionsamhlacha a oibríonn iad siúd faoi 16 bliana d’aois a bheith cláraithe ag tuismitheoir nó ag caomhnóir dlíthiúil

source: Information on registering is available on the IAA website
ga: Tá fáil ar thuilleadh faisnéise ar chlárúchán ar láithreán gréasán ÚEÉ

source: When operating a drone or model aircraft, you must never operate it:
ga: Nuair a bhíonn drón nó aerárthach mionsamhlach á oibriú, ní mór duit gan é a oibriú riamh:

source: • If it will be a hazard to another aircraft in flight
ga: • Má bheidh sé ina ghuais d’aerárthach eile atá ag eitilt

source: • Over a crowd of people
ga: • Os cionn slua daoine

source: • Farther than 300 metres from you
ga: • Níos faide ná 300 méadar amach uait

source: • Within 120 metres of any person, vessel or structure not under your control
ga: • Laistigh de 120 méadar d’aon duine, árthach nó struchtúr nach bhfuil faoi do smacht

source: • Closer than 5 kilometres from an aerodrome
ga: • Níos giorra ná 5 chiliméadar ó aerodróm

source: • In a negligent or reckless manner so as to endanger the life or property of others
ga: • Ar bhealach faillíoch nó meargánta a chuirfidh beatha nó maoin daoine eile i mbaol

source: • Over 120 metres above ground level
ga: • Níos airde ná 120 méadar os cionn leibhéal na talún

source: • In civil or military controlled airspace
ga: • In aerspás sibhialta nó atá faoi rialú míleata

source: • In restricted areas such as military installations and prisons
ga: • I limistéir atá faoi chosc, ar nós suiteálacha míleata agus príosún

source: • Unless you have permission from the landowner for take-off and landing
ga: • Mura bhfuil cead agat ó úinéir na talún d’éirí de thalamh agus do thuirlingt an dróin/an aerárthaigh

source: Unmanned aircraft of 25kg or more must be registered in a similar manner to manned aircraft
ga: Ní mór d’aerárthach gan fhoireann ar a bhfuil meáchan 25kg nó níos mó a bheith cláraithe ar bhealach cosúil leis an mbealach a chláraítear aerárthach le foireann

source: You have to be aged 16 or over before you can apply for a firearms certificate
ga: Ní mór duit a bheith 16 bliain d'aois nó os a chionn sular féidir leat iarratas ar dheimhniú airm tine

source: You have to be aged 14 or over before you can apply for a firearms training certificate
ga: Ní mór duit a bheith 14 bliain d'aois nó os a chionn sular féidir leat iarratas ar dheimhniú oiliúna arm tine

source: A firearms training certificate does not allow you to own a firearm but it does allow you to possess a firearm while carrying and using it under the supervision of the person who holds a firearm certificate for that firearm and is over 18 years of age
ga: Ní gá go mbeadh deimhniú oiliúna arm tine a ligfidh tú chun féin ar arm tine ach cuireann sé deis a thabhairt duit chun arm tine a shealbhú agus iad i mbun agus é a úsáid faoi mhaoirseacht an duine a bhfuil deimhniú airm tine don arm tine agus tá os cionn 18 mbliana d'aois

source: The requirement to have a firearm certificate also applies to crossbows, spearguns and all airguns above a certain muzzle velocity (including paintball markers)
ga: An ceanglas go mbeadh deimhniú airm tine i bhfeidhm freisin d'crosbhoghanna, spearguns agus go léir thuas airguns treoluas muzzle áirithe (lena n-áirítear marcóirí paintball)

source: There is no set minimum age at which you can own a knife
ga: Níl aon aois íosta a leagtar ag ar féidir leat féin le scian

source: However, it is an offence to have a knife in a public place without a good reason, such as for work
ga: Mar sin féin, is cion é a bheith acu scian in áit phoiblí gan údar maith, mar shampla le haghaidh oibre

source: There is a range of services specifically for children and certain services are provided free of charge even if their parents do not have a medical card
ga: Tá raon seirbhísí ann atá ar fáil go sonrach do leanaí agus soláthraítear seirbhísí áirithe saor in aisce fiú amháin má bhíonn cárta leighis ag a dtuismitheoirí

source: These services are generally provided as part of maternity and infant welfare services, health services for preschool children and school health services
ga: Cuirtear na seirbhísí sin ar fáil go ginearálta mar chuid de: seirbhísí máithreachais agus leasa naíonáin, seirbhísí sláinte do leanaí réamhscoile agus seirbhísí sláinte scoile

source: Children are also entitled to vaccination and immunisation services free of charge
ga: Bíonn leanaí i dteideal seirbhísí vacsaínithe agus imdhíonachta saor in aisce

source: In general, parental consent is required for children to have medical and surgical tests and procedures and to receive vaccinations and inoculations
ga: Go ginearálta, bíonn sé riachtanach toiliú tuismitheora a fháil do leanaí maidir le tástálacha agus gnáthaimh leighis agus mháinliachta agus chun vacsaíní agus ionacluithe a fháil

source: Under the Non-Fatal Offences Against the Person Act 1997, children aged 16 and over may themselves give consent to surgical procedures
ga: Faoin Acht um Chionta Neamh-Mharfacha in Aghaidh an Duine 1997, féadfaidh leanaí atá 16 bliana d’aois nó níos sine toiliú a thabhairt maidir le gnáthaimh mháinliachta

source: Body piercing and tattooing
ga: Tolladh coirp agus tatú a fháil

source: There is no legislation regulating body piercing and tattooing
ga: Níl aon reachtaíocht a rialaíonn tolladh coirp agus tatú a fháil

source: As a result there is no legal minimum age at which you can get a body piercing or tattoo
ga: Dá thoradh sin, níl aon íos-aois dhlíthiúil gur féidir tolladh coirp nó tatú a fháil

source: Under Directive 2011/84/EU of 20 September 2011(pdf) you must be aged 18 or over to have your teeth whitened
ga: Faoi Threoir 2011/84/EU an 20 Meán Fómhair 2011 (pdf) caithfidh tú a bheith 18 mbliana d'aois nó os a chionn chun fiacla a ghealadh

source: Under the Public Health (Sunbeds) Act 2014 you must be aged 18 or over to use a sunbed
ga: Faoin Acht Sláinte Poiblí (Leapacha Gréine) Act 2014, ní mór duit a bheith 18 bliain d'aois nó os a chionn a bheidh le lamháil a úsáid leapa gréine

source: You cannot become a blood donor until you are aged 18
ga: Ní féidir le duine a bheith mar dheontóir fola go dtí go mbíonn siad 18 mbliana d’aois

source: There is no set minimum age in Ireland at which contraceptive advice and prescriptions may be provided
ga: Níl aon aois íosta inar féidir comhairle agus oidis frithghiniúna a thabhairt

source: The age of consent to sexual activity is 17 and it may be a criminal offence to have sex with a person under 17 years of age
ga: Is í an aois toilithe maidir le gníomhaíocht ghnéasach ná 17 mbliana d’aois agus féadfaidh cion coiriúil a bheith i gceist nuair a bhíonn gnéas ag duine le duine atá faoi bhun 17 mbliana d’aois

source: This means that providers of contraceptive services are entitled to refuse to provide those services to people under 17
ga: Ciallaíonn sé sin go bhfuil soláthraithe na seirbhísí frithghiniúna i dteideal na seirbhísí sin a dhiúltú do dhaoine faoi bhun 17 mbliana d’aois

source: Under Section 3 of the Criminal Law (Sex Offences) Act 2006 as amended by Section 5 of the Criminal Law (Sexual Offences) (Amendment) Act 2007 it is a criminal offence to engage or attempt to engage in a sexual act with a child under 17 years of age
ga: Faoi Alt 3 den Acht um an Dlí Coiriúil (Cionta Gnéis) 2006 arna leasú ag Alt 5 den Acht um an Dlí Coiriúil (Cionta Gnéasacha) (Leasú) 2007, is cion coiriúil é dul i ngleic nó iarracht a dhéanamh dul i ngleic le gníomh gnéis le leanbh atá faoi bhun 17 mbliana d’aois

source: It is not a defence to show that the child consented to the sexual act
ga: Ní cosaint ar bith é a léiriú gur thoiligh an leanbh don ghníomh gnéasach

source: The consent of the Director of Public Prosecutions is required for any prosecution of a child under the age of 17 years for this offence
ga: Bíonn toiliú riachtanach ón Stiúrthóir Ionchúiseamh Poiblí maidir le hionchúiseamh linbh ar bith atá faoi bhun 17 mbliana d’aois

source: A girl under the age of 17 who has sexual intercourse may not be convicted of an offence on that ground alone
ga: D’fhéadfaí gan cailín 17 mbliana d’aois a raibh caidreamh collaí aici a chiontú as an gcion ar an bhforas sin amháin

source: Recognition of preferred gender
ga: Aitheantas ar inscne roghnaithe

source: An application can be made for a gender recognition certificate on behalf of a child aged 16 years or over if a court order is obtained that exempts the child from meeting the age requirement
ga: Is féidir iarratas a dhéanamh ar dheimhniú aitheantais inscne thar ceann linbh d'aois 16 bliana nó os a chionn má tá ordú cúirte a fuarthas go díolmhaítear an leanbh ó freastal ar an riachtanas d'aois 18 nó os a chionn

source: If you are ordinarily resident in Ireland, the minimum age at which you can marry is 18 years
ga: Má bhíonn gnáthchónaí ort in Éirinn, is í an aois íosta ag ar féidir leat pósadh ná 18 mbliana d’aois

source: This is the case even if you marry outside of Ireland
ga: Tá an scéal amhlaidh fiú má phósann tú lasmuigh d’Éirinn

source: In certain special circumstances, you may be able to get a Court Exemption Order allowing a marriage to proceed even if one or both parties are under 18
ga: I gcúinsí speisialta ar leith, b'fhéidir go mbeadh ar chumas an duine Ordú Díolúine Cúirte a fháil a thugann cead don phósadh dul ar aghaidh fiú amháin mura bhfuil an bheirt pháirtithe faoi bhun 18 mbliana d’aois

source: Parental consent is not required
ga: Níl toiliú tuismitheora riachtanach

source: Further information is available in our documents on the legal requirements for marriage
ga: Tuilleadh eolais ar fáil inár ndoiciméad ar na ceanglais dlí chun pósadh

source: A parent is required to maintain a dependent child
ga: Bíonn dualgas ar thuismitheoir leanbh cleithiúnach a chothabháil

source: A dependent child is a child who:
ga: Leanbh cleithiúnach ná leanbh:

source: • Is under 18 years old or
ga: • Atá faoi bhun 18 mbliana d’aois nó

source: • Is over 18 and under 23 years old but is still in full-time education
ga: • Atá níos sine ná 18 mbliana d’aois agus faoi bhun 23 bliana d’aois ach fós i mbun oideachais go lánaimseartha

source: If a court decides that the parent of a dependent child has failed to provide such maintenance for the child as is proper in the circumstances, it may order that parent to make periodical maintenance payments to support the child
ga: Má chinneann cúirt gur theip ar thuismitheoir leanbh cleithiúnach cothabháil a sholáthar ar bhealach atá ceart sna cúinsí, d’fhéadfadh sí ordú a thabhairt go ndéanfaí íocaíochtaí cothabhála tréimhsiúla chun tacú leis an leanbh

source: The court may also order a parent to pay a lump sum
ga: Lena chois sin, d’fhéadfadh an chúirt ordú a thabhairt don tuismitheoir cnapshuim a íoc

source: Further information is available in our documents, Maintenance orders and agreements and Maintenance and unmarried couples
ga: Tuilleadh eolais inár ndoiciméad, Orduithe agus comhaontuithe cothabhála agus Cothabháil agus lánúin neamhphósta

source: You can leave home at age 16, provided you have your parents’ consent
ga: Féadfaidh leanbh an baile a fhágáil ag 16 bliana d’aois má bhíonn toiliú tuismitheora acu

source: No consent is required at age 18
ga: Níl toiliú ar bith riachtanach ag 18 mbliana d’aois

source: If you leave home before you are 18 without your parents’ consent and you are considered to be homeless or at risk, Tusla may be asked to intervene
ga: Má fhágann tú an baile roimh 18 mbliana d’aois gan toiliú tuismitheoirí agus go meastar go bhfuil tú gan dídean nó i mbaol, féadfar iarratas a dhéanamh ar an Ghníomhaireach um Leanaí agus an Teaghleach (Tusla) idirghabháil a dhéanamh

source: Information on the powers available to Tusla is available in our document, Children in care
ga: Tá eolas faoi na cumhachtaí atá ar fáil do Tusla ar fáil inár ndoiciméad, Leanaí faoi chúram

source: If you have been adopted and wish to trace your natural parents, you can have your details entered in the Adoption Authority’s National Adoption Contact Preference Register which facilitates contact between adopted people and their natural families
ga: Más leanbh uchtaithe tú agus gur mian leat do thuismitheoirí nádúrtha a rianú, féadfar do shonraí a iontráil ar Chlár Tosaíochta Teagmhála na hUchtála Náisiúnta an tÚdarás Uchtála a éascaíonn teagmháil idir daoine uchtaithe agus a dteaghlaigh nádúrtha

source: However, you must be 18 years of age or over
ga: Mar sin féin, caithfidh tú a bheith 18 mbliana d’aois nó níos sine

source: The age of criminal responsibility is 12 years of age
ga: Is í aois na freagrachta coiriúla ná 12 bliana d’aois

source: This means that children who have not reached the age of 12 cannot be charged with an offence
ga: Ciallaíonn sé seo nach féidir cion a bheith curtha i leith leanaí mura bhfuil 12 bliana d’aois sroichte acu

source: There is an exception, however, for children aged 10 or 11, who can be charged with murder, manslaughter, rape or aggravated sexual assault
ga: Mar sin féin, tá eisceacht ann maidir le leanaí atá 10 nó 11 bliana d’aois, agus is féidir dúnmharú, dúnorgain, éigniú nó ionsaí forthromaithe gnéis a chur ina leith

source: Where a child under 14 years of age is charged with an offence, no further proceedings can be taken without the consent of the Director of Public Prosecutions
ga: Nuair a bhíonn cion curtha i leith linbh atá faoi bhun 14 bliana d’aois, ní féidir imeachtaí breise ar bith a thógáil gan toiliú ón Stiúrthóir Ionchúiseamh Poiblí

source: Where the Gardaí have reasonable grounds for believing that a child under 12 years of age has committed an offence with which the child cannot be charged due to his/her age, the Gardaí must take the child to his/her parents or guardian
ga: Nuair a bhíonn foras réasúnta ag Gardaí a chreidiúint go bhfuil cion déanta ag leanbh faoi bhun 12 bliana d’aois agus nach féidir an leanbh a chúiseamh toisc cúrsaí aoise, caithfidh na Gardaí an leanbh a thabhairt chuig na tuismitheoirí nó caomhnóir

source: Where this is not possible, the Gardaí will arrange for the child to be taken into the custody of the Child and Family Agency (Tusla) services for the area in which the child normally resides
ga: Nuair nach mbíonn a leithéid indéanta, eagróidh na Gardaí go nglacfaidh an Ghníomhaireach um Leanaí agus an Teaghleach (Tusla) freagracht as an leanbh sa limistéar ina bhfuil gnáthchónaí ar an leanbh

source: It is possible that children under 12 years of age who commit criminal offences will be dealt with by Tusla and not the criminal justice system
ga: D’fhéadfadh sé nach láimhseálfadh an córas ceartais choiriúil cionta coiriúla a dhéanann leanaí faoi bhun 12 bliana d’aois - d’fhéadfadh Tusla an dualgas sin a chomhlíonadh

source: Detention in a Garda station
ga: Coinneáil i stáisiún na nGardaí

source: When a child is detained in a Garda station it is the duty of the Garda in charge of the station to ensure that, as far as possible, the child is not allowed meet with or associate with adult suspects being detained in the station at the same time
ga: Nuair a bhíonn leanbh faoi choinneáil i stáisiún na nGardaí, bíonn dualgas ar an nGarda atá i gceannas an stáisiúin a chinntiú, chomh fada agus is féidir, nach gceadaítear don leanbh casadh nó a bheith i dteagmháil le hamhrastaigh atá sa stáisiún ag an am céanna

source: A child may not be interviewed in a Garda station except in the presence of his/her parent or guardian
ga: Ní féidir leanbh a chur faoi agallamh i stáisiún na nGardaí ach amháin nuair a bhíonn tuismitheoir nó caomhnóir i láthair

source: It may be permitted where there are very special circumstances, for example, where a delay in questioning would involve a risk of death or injury
ga: D’fhéadfaí é a cheadú i gcúinsí speisialta, mar shampla, nuair a chruthaíonn moill sa phróiseas ceistiúcháin baol báis nó díobhála

source: Children being charged with a crime are dealt with by the Children Court
ga: Nuair atá coir á chur i leith linbh, déileáiltear leis sa Chúirt Leanaí

source: The court can impose a period of detention on a child
ga: Féadfaidh an chúirt tréimhse coinneála a ghearradh ar leanbh

source: Where the child is under 16 years of age the child is detained in a children detention school which are managed by the Irish Youth Justice Service
ga: Nuair a bhíonn leanbh faoi bhun 16 bliana d’aois, déantar an leanbh a choinneáil i scoil choinneála leanaí atá á bhainistiú ag Seirbhís Ceartas Óige na hÉireann

source: Children aged 16 and 17 are detained in a child detention centre
ga: Déantar leanaí atá 16 nó 17 bliana d’aois a choinneáil in ionad coinneála leanaí

source: However, the court can only impose a detention order where it is satisfied that it is the only suitable way to deal with the child and, for a child under 16 years of age, that a place in a children detention school is available
ga: Mar sin féin, ní féidir leis an gcúirt ordú coinneála a ghearradh ach amháin nuair atá sí sásta gurb é sin an t-aon bhealach feiliúnach chun déileáil leis an leanbh, agus go mbeadh áit ar fáil do leanbh faoi bhun 16 bliana d’aois i scoil choinneála leanaí

source: Apart from detention there are also diversion programmes and community sanctions available to the court
ga: Chomh maith leis an gcoinneáil, bíonn cláir athstiúrtha agus smachtbhannaí pobail ar fáil don chúirt

source: There is more information on children and the criminal justice system in our section on children and young offenders
ga: Tá tuilleadh eolais ar fáil faoi leanaí agus an córas ceartais choiriúil inár rannóg ar leanaí agus ciontóirí óga

source: In order to vote in an election or referendum in Ireland, you must be registered to vote
ga: Chun vóta a chaitheamh i dtoghchán nó reifreann in Éirinn, caithfidh tú a bheith cláraithe le vótáil

source: To be eligible to be included on the Register of Electors, you must be at least 18 years old on the day the Register comes into force (15 February)
ga: Chun a bheith incháilithe le háireamh ar Chlár na dToghthóirí, caithfidh tú a bheith 18 mbliana d’aois ar a laghad ar an lá a thagann an Clár i bhfeidhm (15 Feabhra)

source: You are eligible for inclusion in the supplement to the Register of Electors on or after the day on which you reach 18 years of age
ga: Bíonn tú incháilithe le dul ar fhorlíonadh Chlár na dToghthóirí ar an lá a bhíonn tú 18 mbliana d’aois nó ina dhiaidh sin

source: You can be included in the supplement if this birthday falls after the closing date for applications for the supplement but is on or before polling day
ga: Féadfar tú a áireamh san fhorlíonadh má thiteann do bhreithlá tar éis spriocdháta na n-iarratas don fhorlíonadh, ach má thiteann sé ar an lá vótaíochta nó roimhe

source: If you are within this category, you should submit your application with a copy of your birth certificate
ga: Má thiteann tú laistigh den chatagóir sin, ba chóir duit iarratas a sheoladh isteach mar aon le do theastas breithe

source: You cannot stand as a candidate in an election until you are at least 18 years of age
ga: Ní féidir seasamh mar iarrthóir i dtoghchán go dtí go mbíonn tú 18 mbliana d’aois

source: • Age 18 for local elections • Age 21 for national and European elections • Age 35 for presidential elections Contracts
ga: Mura bhfuil nó mura raibh tú pósta, ní féidir leat conradh a dhéanamh atá ina cheangal de réir an dlí go dtí go mbíonn tú 18 mbliana d’aois

source: The exception to this is contracts for necessaries and beneficial contracts of service which are in your best interests
ga: Bíonn eisceacht ann maidir le conarthaí riachtanacha agus conarthaí leasa seirbhíse atá chun do leasa

source: Contracts for necessaries usually include contracts for food, clothing and lodging, but may also cover contracts for items connected with education and training such as school books and training uniforms
ga: Baineann conarthaí riachtanacha go hiondúil le conarthaí bia, éadaí agus lóistín, ach d’fhéadfaí conarthaí a áireamh freisin a bhaineann le hoideachas agus oiliúint cosúil le leabhair scoile agus éidí oiliúna

source: Beneficial contracts of service usually involve contracts for apprenticeships or contracts with agents or managers
ga: Baineann conarthaí leasa seirbhíse go hiondúil le conarthaí do phrintíseachtaí nó conarthaí le gníomhairí nó bainisteoirí

source: These contracts of service are only enforceable if they are to your advantage and in your best interests
ga: Ní bhíonn na conarthaí seirbhíse sin infheidhmithe ach amháin má tá buntáiste ann duit nó gur chun do leasa iad
